{
  "personalInfo": {
    "name": "Ayman Dandan",
    "role": "Software Engineer & Web Developer",
    "bio": "I build exceptional digital experiences with clean, efficient code and thoughtful design.",
    "email": "ayman@example.com",
    "location": "Saida, Lebanon",
    "avatar": "/images/Profile.jpg",
    "availability": "Freelance & Full-time",
    "about": {
      "intro": "I'm a passionate software engineer with a strong focus on creating beautiful, functional, and user-centered digital experiences. With over 5 years of experience in the industry, I've had the privilege of working with various technologies and delivering high-quality solutions to clients worldwide.",
      "story": "My journey in technology began when I built my first website at the age of 15, and I've been hooked ever since. I believe in clean, efficient code and thoughtful design that not only looks great but also delivers real value to users.",
      "cvUrl": "/resume.pdf"
    }
  },
  "socialLinks": [
    {
      "name": "GitHub",
      "url": "https://github.com/aymandandan",
      "icon": "github"
    },
    {
      "name": "LinkedIn",
      "url": "https://linkedin.com/in/aymandandan",
      "icon": "linkedin"
    }
  ],
  "skills": [
    {
      "name": "Frontend Development",
      "items": [
        { "name": "HTML5 & CSS3", "level": 95 },
        { "name": "JavaScript (ES6+)", "level": 88 },
        { "name": "React.js", "level": 85 },
        { "name": "Vue.js", "level": 80 },
        { "name": "Responsive Design", "level": 90 }
      ]
    },
    {
      "name": "Backend Development",
      "items": [
        { "name": "Node.js", "level": 85 },
        { "name": "Python", "level": 80 },
        { "name": "Express", "level": 82 },
        { "name": "RESTful APIs", "level": 85 },
        { "name": "Database Design", "level": 78 }
      ]
    }
  ],
  "contact": {
    "email": "ayman@example.com",
    "location": "Saida, Lebanon",
    "coordinates": {
      "lat": 33.5574477,
      "lng": 35.3718607
    }
  },
  "projects": [
    {
      "title": "E-commerce Platform",
      "description": "A full-stack e-commerce solution with React, Node.js, and MongoDB. Features include user authentication, product catalog, shopping cart, and payment processing.",
      "image": "/images/projects/ecommerce.jpg",
      "tags": ["React", "Node.js", "MongoDB", "Express", "Stripe"],
      "github": "https://github.com/aymandandan/ecommerce-platform",
      "demo": "https://ecommerce-demo.aymandandan.com",
      "category": "web"
    },
    {
      "title": "Portfolio Website",
      "description": "A modern, responsive portfolio website built with Next.js and Tailwind CSS. Features dark mode, smooth animations, and a clean, minimalist design.",
      "image": "/images/projects/portfolio.jpg",
      "tags": ["Next.js", "React", "Tailwind CSS", "Framer Motion"],
      "github": "https://github.com/aymandandan/portfolio",
      "demo": "https://aymandandan.com",
      "category": "web"
    },
    {
      "title": "Task Management App",
      "description": "A collaborative task management application with real-time updates, drag-and-drop interface, and team collaboration features.",
      "image": "/images/projects/taskapp.jpg",
      "tags": ["React", "Firebase", "Material UI", "Redux"],
      "github": "https://github.com/aymandandan/task-management-app",
      "demo": "https://tasks.aymandandan.com",
      "category": "web"
    },
    {
      "title": "UI/UX Design System",
      "description": "A comprehensive design system with reusable components, design tokens, and documentation for consistent UI development.",
      "image": "/images/projects/design-system.jpg",
      "tags": ["Figma", "Storybook", "React", "Styled Components"],
      "github": "https://github.com/aymandandan/design-system",
      "demo": "https://design.aymandandan.com",
      "category": "design"
    },
    {
      "title": "Mobile App Development",
      "description": "A cross-platform mobile application built with React Native, featuring offline support, push notifications, and native performance.",
      "image": "/images/projects/mobile-app.jpg",
      "tags": ["React Native", "Expo", "Redux", "Firebase"],
      "github": "https://github.com/aymandandan/mobile-app",
      "demo": "https://expo.dev/@aymandandan/app",
      "category": "mobile"
    },
    {
      "title": "Data Visualization Dashboard",
      "description": "An interactive dashboard for data analysis and visualization with real-time data updates and custom reporting.",
      "image": "/images/projects/dashboard.jpg",
      "tags": ["D3.js", "React", "Node.js", "MongoDB"],
      "github": "https://github.com/aymandandan/data-dashboard",
      "demo": "https://dashboard.aymandandan.com",
      "category": "web"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "Tech Innovations Inc.",
      "period": "2020 - Present",
      "description": [
        "Developed and maintained responsive web applications using React and Node.js",
        "Collaborated with cross-functional teams to deliver high-quality software solutions",
        "Implemented new features and optimized existing code for better performance"
      ]
    },
    {
      "role": "Frontend Developer",
      "company": "Digital Creations",
      "period": "2018 - 2020",
      "description": [
        "Built interactive user interfaces using modern JavaScript frameworks",
        "Worked closely with designers to implement pixel-perfect UIs",
        "Improved application performance through code optimization"
      ]
    }
  ],
  "education": [
    {
      "degree": "Bachelor of Science in Computer Science",
      "institution": "University of Technology",
      "period": "2014 - 2018",
      "description": "Specialized in Web Development and User Experience Design"
    }
  ],
  "services": [
    {
      "title": "Web Development",
      "icon": "code",
      "description": "Custom websites built with clean, efficient code and modern web standards for optimal performance and user experience.",
      "features": [
        "Responsive Design",
        "Performance Optimization",
        "Cross-browser Compatibility",
        "SEO Best Practices"
      ]
    },
    {
      "title": "UI/UX Design",
      "icon": "paint-brush",
      "description": "Beautiful, intuitive interfaces designed with user experience at the forefront, ensuring engagement and satisfaction.",
      "features": [
        "User Research & Testing",
        "Wireframing & Prototyping",
        "Interaction Design",
        "Design Systems"
      ]
    },
    {
      "title": "Mobile Development",
      "icon": "mobile",
      "description": "Cross-platform mobile applications that deliver native performance with a single codebase.",
      "features": [
        "React Native Development",
        "iOS & Android",
        "Offline Capabilities",
        "App Store Deployment"
      ]
    },
    {
      "title": "Backend Development",
      "icon": "server",
      "description": "Robust backend systems and APIs that power your applications with security and scalability in mind.",
      "features": [
        "API Development",
        "Database Design",
        "Authentication",
        "Cloud Integration"
      ]
    },
    {
      "title": "E-commerce Solutions",
      "icon": "shopping-cart",
      "description": "Complete e-commerce solutions from product catalog to payment processing and order management.",
      "features": [
        "Shopping Cart Integration",
        "Payment Gateways",
        "Inventory Management",
        "Order Processing"
      ]
    },
    {
      "title": "Maintenance & Support",
      "icon": "wrench",
      "description": "Ongoing support and maintenance to keep your website running smoothly and securely.",
      "features": [
        "Regular Updates",
        "Security Patches",
        "Performance Monitoring",
        "Technical Support"
      ]
    }
  ],
  "updates": [
    {
      "id": 1,
      "title": "Launched New Portfolio Website",
      "date": "2023-10-05",
      "category": "Project",
      "readTime": 2,
      "excerpt": "Redesigned and launched my personal portfolio website using Next.js and Tailwind CSS, focusing on performance and accessibility.",
      "content": "I'm excited to share my newly redesigned portfolio website! Built with Next.js 13 and Tailwind CSS, this version focuses on performance, accessibility, and a clean user experience. The site features dark mode, smooth animations, and is fully responsive across all devices. I've also implemented image optimization and code splitting to ensure fast load times."
    },
    {
      "id": 2,
      "title": "Completed Advanced React Course",
      "date": "2023-09-28",
      "category": "Learning",
      "readTime": 3,
      "excerpt": "Finished an advanced React course covering hooks, context API, and performance optimization techniques.",
      "content": "Just completed an intensive React course that deepened my understanding of React's core concepts. The course covered advanced topics including custom hooks, the Context API, performance optimization with useMemo and useCallback, and server-side rendering with Next.js. I've already started implementing these techniques in my projects to create more efficient and maintainable code."
    },
    {
      "id": 3,
      "title": "Open Source Contribution",
      "date": "2023-09-15",
      "category": "Open Source",
      "readTime": 4,
      "excerpt": "Contributed to an open-source project, improving accessibility and adding new features to the component library.",
      "content": "Made my first significant open-source contribution to a popular React component library. I worked on improving keyboard navigation, enhancing ARIA attributes for better screen reader support, and fixing several accessibility issues. This experience was incredibly valuable for understanding the collaborative nature of open-source development and the importance of accessibility in web applications."
    },
    {
      "id": 4,
      "title": "Tech Conference Speaker",
      "date": "2023-08-22",
      "category": "Speaking",
      "readTime": 3,
      "excerpt": "Spoke at the annual Web Dev Summit about modern web development practices and performance optimization.",
      "content": "Had an amazing experience speaking at the Web Dev Summit 2023! My talk, 'Building Blazing Fast Web Apps with Modern JavaScript,' covered performance optimization techniques, code splitting, and the latest web APIs. The Q&A session was particularly engaging, with great discussions about the future of web development and emerging technologies."
    },
    {
      "id": 5,
      "title": "E-commerce Project Launch",
      "date": "2023-08-10",
      "category": "Project",
      "readTime": 4,
      "excerpt": "Successfully launched a full-stack e-commerce platform with React, Node.js, and MongoDB.",
      "content": "I'm thrilled to announce the launch of a major e-commerce project I've been working on! The platform features a responsive React frontend, a robust Node.js/Express backend, and MongoDB for data storage. Key features include user authentication, product catalog, shopping cart, order management, and payment processing integration. The project was a great learning experience in handling complex state management and ensuring a smooth user experience."
    },
    {
      "id": 6,
      "title": "TypeScript Migration Complete",
      "date": "2023-07-25",
      "category": "Development",
      "readTime": 3,
      "excerpt": "Completed migration of a large JavaScript codebase to TypeScript, improving type safety and developer experience.",
      "content": "After several months of work, I've successfully completed the migration of our main project from JavaScript to TypeScript! The process involved setting up the TypeScript configuration, gradually migrating files, and adding proper type definitions. The benefits have been immediately apparent, with fewer runtime errors and much better developer experience thanks to improved IDE support and code navigation."
    },
    {
      "id": 7,
      "title": "UI/UX Design Workshop",
      "date": "2023-07-10",
      "category": "Workshop",
      "readTime": 2,
      "excerpt": "Conducted a workshop on modern UI/UX design principles and best practices for developers.",
      "content": "Led an interactive workshop on UI/UX design principles for developers. We covered topics like color theory, typography, spacing, and accessibility. The hands-on session included redesigning a poorly designed interface, which helped participants understand the impact of good design on user experience. The feedback was overwhelmingly positive, and I'm looking forward to hosting more workshops in the future!"
    },
    {
      "id": 8,
      "title": "Performance Optimization Case Study",
      "date": "2023-06-28",
      "category": "Article",
      "readTime": 5,
      "excerpt": "Published a case study on improving web application performance by 60% through various optimization techniques.",
      "content": "I recently published a detailed case study about a performance optimization project I worked on. The article dives into the techniques used to improve the application's performance by 60%, including code splitting, lazy loading, image optimization, and efficient state management. I also shared the tools and metrics used to measure performance improvements. The response has been fantastic, with many developers reaching out to discuss the implementation details and share their own experiences."
    }
  ]
}
